In [2]:
import pandas as pd

In [14]:
#virgulle yazilmis olan bilgileri ayirdik
#sutun ismi yoksa, HEADER=NONE deriz 
#kendimiz sutun isimleri names methoduyla ekleyebiliriz
#herhangi bir sutunu index sutunu olarak degistirebiliriz
df = pd.read_table("veri.txt",sep = ",",header = None,
                   names = ["isim","yas","cinsiyet"],
                  index_col = "isim")
df

       yas   cinsiyet
isim
Utku    35     Genius
Ahmet   36  Reception
Juan    34        Fat

In [45]:
#ders ve ismi yine index_col methidu ile ayirdik 
df2 = pd.read_table("veri2.txt",sep=",",index_col= ["ders","isim"])
df2

             bir  iki
ders  isim
Mat   Utku    80   85
      Ahmet  100   95
      Juan    80   90
Beden Utku   100   95
      Ahmet   80   75
      Juan    20   15

In [27]:
#okutmak istemedigimiz satirlari cikariyoruz
#sadece istedigimiz sutunlari gormek icin usecold methodu 
df3 = pd.read_table("veri3.txt",sep=",",skiprows = [0,2],usecols= [0,1])
df3

    isim  puan
0   Utku    90
1  Ahmet    80
2  Aycan    60
3   Juan    95
4  Ayfer    30

In [40]:
#eksik veri 
#kendimiz de sisteme nelerin eksik veri oldugunu ekleyebiliyoruz
eksik_veri = {"puan":[-70],"cinsiyet":["Ahmet","n.a"]}
df5 = pd.read_table("veri5.txt",sep=",",na_values=eksik_veri)
df5

    isim puan cinsiyet
0   Utku   95      NaN
1  Ahmet           NaN
2   Juan   50      NaN
3    NaN   90        K
4  Aycan  NaN        K

In [39]:
#hangi veriler eksik gormek icin 
pd.isnull(df5)

    isim   puan  cinsiyet
0  False  False      True
1  False  False      True
2  False  False     False
3   True  False     False
4  False  False     False

In [41]:
#txt dosyasini csv oalrak yeni veri olusturduk ,bu aralarda virguk yazarak yazariyor
df.to_csv("yeni_veri.csv")

In [57]:
#sys paketiyle aralara virgul yerine baska seyler de koyabiliyoruzimport sys
#tab ile ayrilmis istriyorsan read_table, virgul ile ayrilmissa read_csv kullanilir
#xlx, xlsx icin read_excel
#sabut uzunluk icin read_fwf
#javascript formati icin read_json
#html tablo icin read_html
df.to_csv(sys.stdout, sep="|")

isim|yas|cinsiyet
Utku|35|Genius
Ahmet|36|Reception
Juan|34|Fat

In [58]:
#data cleaning 
import pandas as pd ; import numpy as np

In [60]:
#eksik verili bir series dosyasu olusturduk 
s = pd.Series(["Utku",np.nan,"Ahmet","Aycan"])
s

0     Utku
1      NaN
2    Ahmet
3    Aycan
dtype: object

In [63]:
#eksk veri nerde bulmak icin 
#bunun yerine notnull()v deyip tersini de bulabiliriz 
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [64]:
#herhangi bir degeri NaN olarak degistiebiliriz 
s[3]=None

In [69]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [72]:
#eksik verileri kaldirmak icin deopna mergodu kullanilir 
s.dropna()

0     Utku
2    Ahmet
dtype: object

In [73]:
#aynisi boyle de yapilir
s[s.notnull()]

0     Utku
2    Ahmet
dtype: object

In [74]:
#dataframe de eksik veri 
from numpy import nan as NA

In [78]:
#dataframe olusturduk, 2 defa koseli parantezle
b

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [80]:
#eksik veri ola nsatirlari tamamen kaldirmak icin
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [81]:
#eger butun degerler eksikse 
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [82]:
#eksik veri atiyoruz 
df[1] = NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [83]:
#satir degil sutunlardaki hersey NA ise eger
df.dropna(how="all", axis=1)

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [84]:
#eksik veri yerine baska deger atama
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [86]:
#eksik veri yerine 0(sifir) atadik 
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [90]:
#eksik verileri ayri ayri da atama yapabiliriz (suslu parantez icine, satir adiyla beraber yaziyoruz)
#inplace eklersek bu dosya tamamen degismis olur, yazmazsak sadece 1 kereligine oyle gorunur 
df.fillna({0:15,1:25,2:35},inplace= True)

In [91]:
df

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [92]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [95]:
#eksik veriler yerine 1 ust satirdaki degerleri atamak icin 
df.fillna(method="ffill")

C:\Users\ugulb\AppData\Local\Temp\ipykernel_7772\2636484101.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [96]:
#her satirdan sadece 1 tane eksik degeri tamamlamak istersek 
df.fillna(method="ffill",limit=1)

C:\Users\ugulb\AppData\Local\Temp\ipykernel_7772\2129031428.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [97]:
#eksik veri yerine ortalama yazdirabiliriz 
ver = pd.Series([1,0,NA,5])
ver

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [99]:
#satunun ortalamasini eksik veri yerine ekledi
ver.fillna(ver.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [100]:
#ahnisini dataframe icin yaparsak 
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [102]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0